{"image_id": 391895, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000391895.jpg", "caption": "The scene unfolds in a rural setting, where a man is sitting on a motorcycle. He is positioned towards the right side of the image, with his feet resting on the motorcycle's footrest. The motorcycle is parked on a dirt road, with the man seemingly taking a break from his journey. \n\nIn the background, there are a few other people scattered around the scene. One person is located towards the right side of the image, while another person is positioned towards the left side. The third person is located further back, closer to the center of the scene. The presence of these individuals suggests a sense of community or a gathering in the rural area."}
{"image_id": 522418, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000522418.jpg", "caption": "The scene is set in a kitchen where a woman is cutting a large cake. She is positioned towards the right side of the image, holding a knife and cutting the cake. The cake is placed on a table, which is located towards the left side of the image. \n\nThe kitchen is well-equipped with a refrigerator located towards the left side of the image, and an oven is situated towards the right side. There are also two bowls in the scene, one located towards the left side of the image and the other towards the right. The woman appears to be focused on her task, preparing the cake for serving."}
{"image_id": 184613, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000184613.jpg", "caption": "The scene unfolds in a lush green field where a young boy is standing, holding an umbrella. He is positioned towards the left side of the field, with the umbrella slightly above his head. \n\nThere are several cows scattered throughout the field. One cow is located towards the right side of the field, another is positioned towards the center, and the third cow is situated towards the left side of the field. \n\nIn addition to the boy, there are other people present in the scene. One person is located towards the right side of the field, while another person is positioned towards the left side. The third person is standing further back, closer to the center of the field. \n\nThe boy is also holding a bag, which is located towards the left side of the field. The scene suggests a lively outdoor gathering where people are interacting with the cows."}