{"image_id": 391895, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000391895.jpg", "caption": "The scene unfolds in a rural setting, where a man is sitting on a motorcycle. He is positioned towards the right side of the image, with his feet resting on the motorcycle's footrest. The motorcycle is parked on a dirt road, with the man seemingly taking a break from his journey. \n\nIn the background, there are a few other people scattered around the scene. One person is located towards the right side of the image, while another person is positioned towards the left side. The third person is located further back, closer to the center of the scene. The presence of these individuals suggests a sense of community or a gathering in the rural area."}
{"image_id": 522418, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000522418.jpg", "caption": "The scene is set in a kitchen where a woman is cutting a large cake. She is positioned towards the right side of the image, holding a knife and cutting the cake. The cake is placed on a table, which is located towards the left side of the image. \n\nThe kitchen is well-equipped with a refrigerator located towards the left side of the image, and an oven is situated towards the right side. There are also two bowls in the scene, one located towards the left side of the image and the other towards the right. The woman appears to be focused on her task, preparing the cake for serving."}
{"image_id": 184613, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000184613.jpg", "caption": "The scene unfolds in a lush green field where a young boy is standing, holding an umbrella. He is positioned towards the left side of the field, with the umbrella slightly above his head. \n\nThere are several cows scattered throughout the field. One cow is located towards the right side of the field, another is positioned towards the center, and the third cow is situated towards the left side of the field. \n\nIn addition to the boy, there are other people present in the scene. One person is located towards the right side of the field, while another person is positioned towards the left side. The third person is standing further back, closer to the center of the field. \n\nThe boy is also holding a bag, which is located towards the left side of the field. The scene suggests a lively outdoor gathering where people are interacting with the cows."}
{"image_id": 318219, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000318219.jpg", "caption": "The scene is set in a computer lab where a young boy is seated at a desk, engrossed in his computer. He is wearing headphones, which suggests that he is listening to music or an audio program. \n\nThere are several other people in the room, some of them also seated at desks. The room is filled with a total of five keyboards, indicating that it is a shared workspace. \n\nIn addition to the keyboards, there are two computer mice visible in the scene. One is located near the boy, while the other is positioned further away. The presence of multiple people and computers suggests a collaborative learning environment."}
{"image_id": 554625, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000554625.jpg", "caption": "The scene is set in a computer lab where a group of people, including a young boy, are engaged in using computers. The boy is seated at a table, wearing headphones and typing on a keyboard. He is positioned towards the left side of the image. \n\nThere are several other individuals in the room, some of them also using computers. A total of five keyboards are visible in the scene, with one near the boy, another towards the right side of the image, and three more spread out across the room. \n\nIn addition to the keyboards, there are two computer mice present in the scene. One is located towards the right side of the image, while the other is slightly to the left of the center. The individuals in the room are all focused on their tasks, creating a lively and productive atmosphere."}
{"image_id": 397133, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000397133.jpg", "caption": "The scene is set in a large, well-equipped kitchen. A man, dressed in a white shirt and apron, is standing at the counter, preparing food. He is positioned towards the right side of the kitchen, with his back facing the viewer. \n\nThe kitchen is filled with various cooking utensils and appliances. There are numerous pots and pans scattered across the counter, some of which are placed closer to the man, while others are located further away. \n\nIn addition to the pots and pans, there are several bowls of different sizes scattered around the kitchen. Some are located near the man, while others are placed further away. \n\nThe kitchen also features a sink towards the right side of the scene, and a refrigerator is located towards the far right. The man is the main focus of the scene, as he is actively engaged in the cooking process."}
{"image_id": 574769, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000574769.jpg", "caption": "The scene is set in a kitchen where a woman is standing, holding a cat in her arms. She is positioned towards the center of the image, and the cat is comfortably resting on her shoulder. The kitchen is well-equipped with a refrigerator located towards the right side of the scene, a sink towards the left, and a microwave above the sink.\n\nOn the countertop, there are several items, including a bowl, a cup, and a bottle. The bowl is located towards the left side of the counter, the cup is positioned slightly to the right of the bowl, and the bottle is situated towards the right side of the counter. The woman's handbag is placed on the floor, slightly to the left of her, adding a personal touch to the scene."}
{"image_id": 60623, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000060623.jpg", "caption": "The scene captures a young girl sitting at a dining table, blowing out a candle on a bowl of ice cream. She is the main focus of the image, located towards the left side of the scene. \n\nThere are two other people present in the scene. One person is located towards the top left of the image, and the other is positioned towards the top right. The table is quite large, extending across the entire image. \n\nOn the table, there are two bowls. One is located towards the right side of the table, and the other is positioned towards the bottom right. A spoon is also visible, located towards the right side of the table, suggesting that the girl is in the process of eating her ice cream."}
{"image_id": 309022, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000309022.jpg", "caption": "The scene is a large, well-equipped kitchen with a stainless steel countertop. The kitchen is filled with various appliances, including a microwave, oven, and refrigerator. The microwave is located towards the left side of the kitchen, while the oven is positioned towards the right. The refrigerator is situated in the middle of the kitchen.\n\nOn the countertop, there are two bowls, one located towards the left side and the other towards the right. A cup is also present on the counter, slightly to the right of the center. The kitchen is well-organized, and the appliances are neatly arranged, creating a clean and functional environment."}
{"image_id": 5802, "image_file": "/raid_sdd/zzy/data/halle/coco/coco2014/val2014/COCO_val2014_000000005802.jpg", "caption": "The scene is set in a kitchen where two men are working. One man is positioned towards the left side of the kitchen, while the other is on the right. They are both wearing white shirts, indicating that they are likely chefs.\n\nThe kitchen is well-equipped with various appliances. There is a refrigerator located towards the left side of the kitchen, a sink towards the right, and an oven in the middle. The oven is currently in use, as it is filled with food.\n\nOn the countertops, there are several bottles scattered around. Some are located towards the right side of the kitchen, while others are positioned closer to the left. The kitchen also features a bowl, which is located towards the right side of the scene."}